In [1]:
import numpy as np
import pandas as pd

Create two series s1 and s2

In [2]:

s1=pd.Series(['A','B','C','D','E'])
s2=pd.Series(['F','G','H','I','J'])

Create a dataframe by combining the series s1 and s2

In [3]:
df1=pd.DataFrame(s1.append(s2))
df1

   0
0  A
1  B
2  C
3  D
4  E
0  F
1  G
2  H
3  I
4  J

Display the elements of series s1, which are not present in s2

In [4]:
res=s1[s1!=s2]
res

0    A
1    B
2    C
3    D
4    E
dtype: object

Create a series of 35 numbers. Next, covert the series into a dataframe with 5 rows and 7 columns using numpy as well as pandas

In [5]:

s3=pd.Series(np.linspace(1,50,35))
arr=s3.values
arr=np.reshape(arr,(5,7))
df2=pd.DataFrame(arr)
df2

           0          1          2          3          4          5          6
0   1.000000   2.441176   3.882353   5.323529   6.764706   8.205882   9.647059
1  11.088235  12.529412  13.970588  15.411765  16.852941  18.294118  19.735294
2  21.176471  22.617647  24.058824  25.500000  26.941176  28.382353  29.823529
3  31.264706  32.705882  34.147059  35.588235  37.029412  38.470588  39.911765
4  41.352941  42.794118  44.235294  45.676471  47.117647  48.558824  50.000000

Create a series of numbers. Then, display the locations of numbers, which are multiples of 2

In [6]:
s4=pd.Series(np.linspace(1,50,35).astype(int))
arr=[]
for i in s4.index:
  
  if s4[i]%2==0:
    arr.append(i)
arr

[1, 4, 5, 8, 11, 12, 15, 16, 18, 19, 22, 23, 26, 29, 30, 33, 34]

Create a series of strings. From this series, display the strings having at least three vowels

In [7]:
s5=pd.Series(['hello','myself','Alok Pratap Singh'])
vowels="aeiou"
for i in s5.index:
  res=[each for each in s5[i] if each in vowels]
  if len(res)>=3:
    print(len(res),end=" ")
    print(s5[i])

4 Alok Pratap Singh

#From any given CSV file, import only specified columns and display in a dataframe.

In [8]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
151          152         1       1  ...  66.6000    C2         S
152          153         0       3  ...   8.0500   NaN         S
153          154         0       3  ...  14.5000   NaN         S
154          155         0       3  ...   7.3125   NaN         S
155          156         0       1  ...  61.3792   NaN         C

[156 rows x 12 columns]

In [9]:
titanic_train.dtypes == "object"
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a
titanic_train[a].describe()

                                                     Name   Sex  ... Cabin Embarked
count                                                 156   156  ...    31      155
unique                                                156     2  ...    28        3
top     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  male  ...   D26        S
freq                                                    1   100  ...     2      110

[4 rows x 5 columns]

In [10]:
titanic_train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   156.000000  156.000000  156.000000  ...  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077  ...    0.615385    0.397436   28.109587
std      45.177428    0.477275    0.795459  ...    1.056235    0.870146   39.401047
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    6.750000
25%      39.750000    0.000000    2.000000  ...    0.000000    0.000000    8.003150
50%      78.500000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     117.250000    1.000000    3.000000  ...    1.000000    0.000000   30.371850
max     156.000000    1.000000    3.000000  ...    5.000000    5.000000  263.000000

[8 rows x 7 columns]

In [11]:
titanic_train[['Name','Sex','Age']]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
151                  Pears, Mrs. Thomas (Edith Wearne)  female  22.0
152                                   Meo, Mr. Alfonzo    male  55.5
153                    van Billiard, Mr. Austin Blyler    male  40.5
154                              Olsen, Mr. Ole Martin    male   NaN
155                        Williams, Mr. Charles Duane    male  51.0

[156 rows x 3 columns]